In [1]:
import pandas as pd
df=pd.read_csv("Titanic_data.csv")
df.head()

,Survived,Pclass,Sex,Age,Fare,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,0,3,male,22.0,7.2500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,1,female,38.0,71.2833,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1,3,female,26.0,7.9250,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1,1,female,35.0,53.1000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,0,3,male,35.0,8.0500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df=df.dropna(how='all',axis=1)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le_sex=LabelEncoder()

In [12]:
df["Sex_n"]=le_sex.fit_transform(df.Sex)

In [13]:
df.head()

   Survived  Pclass     Sex   Age     Fare  Sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

In [14]:
df=df.drop("Sex",axis=1)

In [15]:
df.head()

   Survived  Pclass   Age     Fare  Sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

In [16]:
from sklearn import tree

In [17]:
model=tree.DecisionTreeClassifier()

In [19]:
from sklearn.model_selection import train_test_split

In [30]:
X=df.drop("Survived",axis=1)

In [31]:
X.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [32]:
Y=df.Survived
Y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [33]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2)

In [34]:
len(X_train)

571

In [35]:
len(X_test)

143

In [27]:
df.isnull().sum()

Survived      0
Pclass        0
Age         177
Fare          0
Sex_n         0
dtype: int64

In [28]:
df=df.dropna()

In [29]:
df.isnull().sum()

Survived    0
Pclass      0
Age         0
Fare        0
Sex_n       0
dtype: int64

In [36]:
model.fit(X_train,Y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [37]:
model.score(X_test,Y_test)

0.8111888111888111

In [43]:
df_n=pd.read_csv("Titanic_data.csv")
df_n.head()

,Survived,Pclass,Sex,Age,Fare,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,0,3,male,22.0,7.2500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,1,female,38.0,71.2833,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1,3,female,26.0,7.9250,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1,1,female,35.0,53.1000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,0,3,male,35.0,8.0500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
df_n.isnull().sum()

Survived         0
Pclass           0
Sex              0
Age            177
Fare             0
Unnamed: 5     891
Unnamed: 6     891
Unnamed: 7     891
Unnamed: 8     891
Unnamed: 9     891
Unnamed: 10    891
Unnamed: 11    891
Unnamed: 12    891
dtype: int64

In [44]:
df_n=df_n.dropna(how="all",axis=1)

In [45]:
df_n.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [46]:
from sklearn.preprocessing import LabelEncoder
le_sex=LabelEncoder()
df_n["Sex_n"]=le_sex.fit_transform(df_n.Sex)
df_n.head()

   Survived  Pclass     Sex   Age     Fare  Sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

In [48]:
df_n=df_n.drop("Sex",axis=1)
df_n.head()

   Survived  Pclass   Age     Fare  Sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

In [49]:
df_n.Age=df_n.Age.fillna(df_n.Age.mean())

In [50]:
df_n.isnull().sum()

Survived    0
Pclass      0
Age         0
Fare        0
Sex_n       0
dtype: int64

In [51]:
X_n=df_n.drop("Survived",axis=1)

In [52]:
Y_n=df_n.Survived

In [53]:
X_ntrain,X_ntest,Y_ntrain,Y_ntest=train_test_split(X_n,Y_n,test_size=0.2)

In [54]:
len(X_ntrain)

712

In [55]:
len(X_ntest)

179

In [56]:
model.fit(X_ntrain,Y_ntrain)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [57]:
model.score(X_ntest,Y_ntest)

0.7150837988826816